In [ ]:


a = df.rename(columns = {'old' : 'new', 'old1' : 'new1'}, inplace = True)

In [1]:
import numpy as np
import pandas as pd

In [7]:
data = {'Name': ['Bhavish', 'Abhinabh', 'Siddhu'],
   'Age': [25, 32, 28]}
df = pd.DataFrame(data)
print(df)



# Search for a value in the 'Name' column
search_value = 'Siddhu'

print(df['Name'] == search_value)


result = df[df['Name'] == search_value]
result

       Name  Age
0   Bhavish   25
1  Abhinabh   32
2    Siddhu   28
0    False
1    False
2     True
Name: Name, dtype: bool

     Name  Age
2  Siddhu   28

In [10]:
print(df['Name'].where(df['Age'] < 50))

0     Bhavish
1    Abhinabh
2      Siddhu
Name: Name, dtype: object

In [19]:
data = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30],
  "qualified": [True, False, False]
}

df = pd.DataFrame(data)
print(df)

newdf = df.drop("age", axis='columns')

print(newdf)

    name  age  qualified
0  Sally   50       True
1   Mary   40      False
2   John   30      False
    name  qualified
0  Sally       True
1   Mary      False
2   John      False

In [28]:
print(newdf.loc[0:2,'name']) 

# filter using df.loc(row dataset index/ labels you've given , 'col_name') method

print(newdf.iloc[0:2,0:2])

# df.iloc(row index range , col_index range)

print(newdf[['name','qualified']]) # fancy indexing

0    Sally
1     Mary
2     John
Name: name, dtype: object
    name  qualified
0  Sally       True
1   Mary      False
    name  qualified
0  Sally       True
1   Mary      False
2   John      False

In [39]:
# Pandas Normalize Using Mean Normalization.

# Pandas Normalize Using Mean Normalization.
#normalized_df=(df-df.mean())/df.std()
print(df)

mean = df.age.mean()
print(mean)
std = df.age.std()
print(std)

normalized_df = (df.age - mean/std)  # x-m / sigma

print(normalized_df)

    name  age  qualified
0  Sally   50       True
1   Mary   40      False
2   John   30      False
40.0
10.0
0    46.0
1    36.0
2    26.0
Name: age, dtype: float64

In [43]:
food = ["noodles","chikki","paneer"]
df['food'] = food
print(df)

    name  age  qualified     food
0  Sally   50       True  noodles
1   Mary   40      False   chikki
2   John   30      False   paneer

In [50]:
df["Rank"] = df.food.rank(axis=0, method = 'average' , ascending = False)
print(df)

    name  age  qualified     food  Rank
0  Sally   50       True  noodles   2.0
1   Mary   40      False   chikki   3.0
2   John   30      False   paneer   1.0

In [59]:
dict = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
  

df = pd.DataFrame(dict)
  
print(df)

df.loc[len(df.index)] = ['Amy', 89, 93] 
  
display(df)

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93